Revit 2027 API
Wall.IsWallCrossSectionValid Method
 Checks whether the desired cross section is valid for the current wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsWallCrossSectionValid(
	WallCrossSection wallCrossSection
)
Public Function IsWallCrossSectionValid (
	wallCrossSection As WallCrossSection
) As Boolean
public:
bool IsWallCrossSectionValid(
	WallCrossSection wallCrossSection
)
member IsWallCrossSectionValid :
        wallCrossSection : WallCrossSection -> bool
Parameters
wallCrossSection WallCrossSection
 The desired cross section.
Return Value
Boolean
 True if the wall can be set to the desired cross section.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace